app/views/resultats/index.html.erb

var ctx = document.getElementById("myChart");
var myChart = new Chart(ctx, {
    type: 'bar',
    data: {
        labels:
        [
        <% @competiteurs.each do |competiteur| %>
                    <% if competiteur.bogestionelections_id == 1 %>
                        <% @candidats.each do |candidat| %>
                             <% if candidat.id == competiteur.candidats_id %>
                                "<%= candidat.ca_prenom %> <%= candidat.ca_nom %><% @bopartis.each do |boparti| %><% if candidat.bopartis_id == boparti.id %> (<%= boparti.pa_nom %>)<% end %><% end %>",
                            <% end %>
                        <% end %>
                    <% end %>
              <% end %>

        ],
        datasets: [{
            label: 'Nombre de votes par candidats',
            data:  <%= @separatevote %>,
            backgroundColor: [
                'rgba(255, 99, 132, 0.2)',
---
SELECT "bopartis".* FROM "bopartis"
SELECT "candidats".* FROM "candidats"