app/controllers/bogestionelections_controller.rb

 def index
     @page_title = "Toutes les élections"
     @bogestionelections = Bogestionelection.all
---
SELECT "bogestionelections".* FROM "bogestionelections"

     def new
        @page_title = "Ajouter une élection"
        @candidats = Candidat.all
        @bopartis = Boparti.all
---
SELECT "candidats".* FROM "candidats"
SELECT "bopartis".* FROM "bopartis"

    def create
        @bogestionelection = Bogestionelection.new(bogestionelection_params)

        @bogestionelection.save

        @result = Bogestionelection.maximum("id")

        @candidats_id = params[:candidats_id]

        @candidats_id.each do |candidat|
            @competiteur = Competiteur.create(:candidats_id => candidat, :bogestionelections_id => @result)
---
INSERT INTO "bogestionelections" ("el_titre", "el_descr", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["el_titre", "Présidentielle"], ["el_descr", ""], ["created_at", 2017-01-26 21:15:11 UTC], ["updated_at", 2017-01-26 21:15:11 UTC]]
SELECT MAX("bogestionelections"."id") FROM "bogestionelections"
INSERT INTO "competiteurs" ("candidats_id", "bogestionelections_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["candidats_id", 1], ["bogestionelections_id", 45], ["created_at", 2017-01-26 21:15:11 UTC], ["updated_at", 2017-01-26 21:15:11 UTC]]