app/controllers/bopartis_controller.rb

SELECT "bopartis".* FROM "bopartis"
---
 def index
     @page_title = "Tous les partis"
     @bopartis = Boparti.all

INSERT INTO "bopartis" ("pa_nom", "pa_sigle", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pa_nom", "FN"], ["pa_sigle", "Front National"], ["created_at", 2017-01-23 17:08:11 UTC], ["updated_at", 2017-01-23 17:08:11 UTC]]
---
    def create

        @boparti = Boparti.new(boparti_params)

        @boparti.save