app/controllers/candidats_controller.rb

 def index
     @page_title = "Tous les candidats"
     @candidats = Candidat.all
     @bopartis = Boparti.all
---
SELECT "candidats".* FROM "candidats"
SELECT "bopartis".* FROM "bopartis"

	def show
    	@candidat = Candidat.find(params[:id])
---
SELECT  "candidats".* FROM "candidats" WHERE "candidats"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def new
        @page_title = "Ajouter un candidat"
		@bopartis = Boparti.all
---
SELECT "bopartis".* FROM "bopartis"

	def create
  		@candidat = Candidat.new(candidat_params)

  		if @candidat.save
---
INSERT INTO "candidats" ("ca_nom", "ca_prenom", "ca_photo", "ca_program", "ca_program_pdf", "ca_accroche", "bopartis_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)