app/controllers/contacts_controller.rb

    def index
        @page_title = "Tous les contacts"
       @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

def create
  @contact = Contact.new(contact_params)
  @contact.save
---
INSERT INTO "contacts" ("co_nom", "co_sujet", "co_message", "co_email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)