app/controllers/resultats_controller.rb

SELECT "candidats".* FROM "candidats"
SELECT "competiteurs".* FROM "competiteurs"
SELECT "bopartis".* FROM "bopartis"
SELECT "votes".* FROM "votes"
SELECT DISTINCT COUNT(DISTINCT "votes"."id") FROM "votes" WHERE (candidats_id = 1)
---
    def index
          @page_title = "Tous les résultats"
          @candidats = Candidat.all
          @competiteurs = Competiteur.all
          @bopartis = Boparti.all
          @separatevote = Array.new;
          @allvotes = Vote.all

          @candidats.each do |candidat|

            @request = "candidats_id".concat(" = ").concat(candidat.id.to_s)
            @vote = @allvotes.distinct.where(@request)