app/controllers/sessions_controller.rb

SELECT  "electeurs".* FROM "electeurs" WHERE "electeurs"."ut_email" = ? LIMIT ?  [["ut_email", "sharoncolin7@gmail.com"], ["LIMIT", 1]]
---
	def create
	  electeur = Electeur.find_by(ut_email: params[:session][:ut_email])