app/controllers/votes_controller.rb

    def index
      @page_title = "Choisissez un candidat"
      @candidats = Candidat.all
      @competiteurs = Competiteur.all
      @bopartis = Boparti.all
      @electeur_id = session[:id]
      @votes = Vote.all
      @todaysdate = Date.today.to_s
      @request = "%".concat(@todaysdate).concat("%")
      @bgoelections = Bogestionelection.where('el_date_debut LIKE ?', @request).all

        if @bgoelections.size == 0
---
SELECT "candidats".* FROM "candidats"
SELECT "competiteurs".* FROM "competiteurs"
SELECT "bopartis".* FROM "bopartis"
SELECT "votes".* FROM "votes"
SELECT "bogestionelections".* FROM "bogestionelections" WHERE (el_date_debut LIKE '%2017-01-26%')
SELECT COUNT(*) FROM "bogestionelections" WHERE (el_date_debut LIKE '%2017-01-26%')

    def new
        @page_title = "Votez !"
        @iduser = Electeur.find(session[:id])
        @vote = params[:idcandidat]
        @bgoelectionid = params[:bgoelectionid]

        if @vote.nil?
            flash[:notice] = 'Vous devez choisir un candidat !'
            flash[:color]  = "danger"
            redirect_to votes_path
        end
        @candidats = Candidat.all
        @bopartis = Boparti.all
---
SELECT "candidats".* FROM "candidats"
SELECT "bopartis".* FROM "bopartis"

    def create
        @electeur_id = session[:id]
        @bgoelectionid = params[:bgoelectionid]
        @todaysdate = Date.today.to_s

        if params[:validate_identite] == "1" and params[:validate_candidat] == "1"

            @candidats_id = params[:candidats_id]
            @vote = Vote.create(:vo_date => @todaysdate, :electeurs_id => @electeur_id, :bogestionelections_id => @bgoelectionid, :candidats_id => @candidats_id)
---
INSERT INTO "bogestionelections" ("el_titre", "el_descr", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["el_titre", "Ma nouvelle élection"], ["el_descr", "Ellle est super"], ["created_at", 2017-01-26 08:33:45 UTC], ["updated_at", 2017-01-26 08:33:45 UTC]]
INSERT INTO "votes" ("vo_date", "electeurs_id", "bogestionelections_id", "candidats_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["vo_date", 2017-01-26 00:00:00 UTC], ["electeurs_id", 1], ["bogestionelections_id", 1], ["candidats_id", 3], ["created_at", 2017-01-26 11:21:42 UTC], ["updated_at", 2017-01-26 11:21:42 UTC]]