app/views/votes/new.html.erb

SELECT "bopartis".* FROM "bopartis"
---
        <% if candidat.id.to_s == @vote %>
            <h3><%= candidat.ca_prenom %><%= candidat.ca_nom %><% @bopartis.each do |boparti| %><% if candidat.bopartis_id == boparti.id %>(<%= boparti.pa_nom %>)<% end %></h3>